https://www.deviantart.com/phil-cho/art/Jack-Frost-Earth-27-commission-901679767
**Имя:** Кей-Фрост (Кевин Форстнер)  
**Силы:** Лёд и холод - но только из  пальцев  
**Состояния:**  
- [ ]	Испуган(а)
- [ ]	Разозлен(а)
- [ ]	Виноват(а)
- [ ]	Отчаялась / Отчаялся
- [ ]	Не уверен (а)

**Драйв:** Защищать свою семью, их дом и мир  

**Ходы:**
- Вырастить из руки ледяной меч и сражаться им
-	Построить ледяной щит
-	Сковать противника льдом
-	Создать ледяной мост, чтобы добраться куда-то

**Комментарий:**  
Герой, пойманный Танжи. Содержится в жарко натопленной камере. Красное лицо, течёт пот.  
Танжи сломали его и теперь всё, что он хочет - создавать ледяные скульптуры. Это его убежище от мира.
